{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "A.m",
    "1": "Artificial intelligence and nonmonotonic reasoning and belief\n  revision",
    "2": "Comptuational science",
    "3": "Computer Science",
    "4": "H.m",
    "5": "IEEE",
    "6": "MIMO, relay, queue-aware, distributive resource control",
    "7": "Mathematical logic and foundations",
    "8": "aaai.org",
    "9": "adap-org",
    "10": "artificial intelligence, approximate reasoning",
    "11": "astro-ph",
    "12": "astro-ph.CO",
    "13": "astro-ph.EP",
    "14": "astro-ph.GA",
    "15": "astro-ph.HE",
    "16": "astro-ph.IM",
    "17": "astro-ph.SR",
    "18": "cmp-lg",
    "19": "cond-mat",
    "20": "cond-mat.dis-nn",
    "21": "cond-mat.mes-hall",
    "22": "cond-mat.mtrl-sci",
    "23": "cond-mat.other",
    "24": "cond-mat.quant-gas",
    "25": "cond-mat.soft",
    "26": "cond-mat.stat-mech",
    "27": "cond-mat.str-el",
    "28": "cond-mat.supr-con",
    "29": "cs.AI",
    "30": "cs.AR",
    "31": "cs.CC",
    "32": "cs.CE",
    "33": "cs.CG",
    "34": "cs.CL",
    "35": "cs.CL, cs.AI, math.CT",
    "36": "cs.CR",
    "37": "cs.CV",
    "38": "cs.CY",
    "39": "cs.DB",
    "40": "cs.DC",
    "41": "cs.DL",
    "42": "cs.DM",
    "43": "cs.DS",
    "44": "cs.ET",
    "45": "cs.FL",
    "46": "cs.GL",
    "47": "cs.GR",
    "48": "cs.GT",
    "49": "cs.HC",
    "50": "cs.IR",
    "51": "cs.IT",
    "52": "cs.LG",
    "53": "cs.LO",
    "54": "cs.MA",
    "55": "cs.MM",
    "56": "cs.MS",
    "57": "cs.NA",
    "58": "cs.NE",
    "59": "cs.NI",
    "60": "cs.OH",
    "61": "cs.OS",
    "62": "cs.PF",
    "63": "cs.PL",
    "64": "cs.RO",
    "65": "cs.SC",
    "66": "cs.SD",
    "67": "cs.SE",
    "68": "cs.SI",
    "69": "cs.SY",
    "70": "econ.EM",
    "71": "eess.AS",
    "72": "eess.IV",
    "73": "eess.SP",
    "74": "gr-qc",
    "75": "hep-ex",
    "76": "hep-lat",
    "77": "hep-ph",
    "78": "hep-th",
    "79": "math-ph",
    "80": "math.AC",
    "81": "math.AG",
    "82": "math.AP",
    "83": "math.AT",
    "84": "math.CA",
    "85": "math.CO",
    "86": "math.CT",
    "87": "math.CV",
    "88": "math.DG",
    "89": "math.DS",
    "90": "math.FA",
    "91": "math.GM",
    "92": "math.GN",
    "93": "math.GR",
    "94": "math.GT",
    "95": "math.HO",
    "96": "math.IT",
    "97": "math.LO",
    "98": "math.MG",
    "99": "math.MP",
    "100": "math.NA",
    "101": "math.NT",
    "102": "math.OA",
    "103": "math.OC",
    "104": "math.PR",
    "105": "math.QA",
    "106": "math.RA",
    "107": "math.RT",
    "108": "math.SP",
    "109": "math.ST",
    "110": "nlin.AO",
    "111": "nlin.AO, nlin.CD, q-bio.NC, physics.bio-ph, cond-mat.dis-nn",
    "112": "nlin.CD",
    "113": "nlin.CG",
    "114": "nlin.PS",
    "115": "nucl-ex",
    "116": "nucl-th",
    "117": "physics.ao-ph",
    "118": "physics.app-ph",
    "119": "physics.bio-ph",
    "120": "physics.chem-ph",
    "121": "physics.class-ph",
    "122": "physics.comp-ph",
    "123": "physics.data-an",
    "124": "physics.flu-dyn",
    "125": "physics.gen-ph",
    "126": "physics.geo-ph",
    "127": "physics.hist-ph",
    "128": "physics.ins-det",
    "129": "physics.med-ph",
    "130": "physics.optics",
    "131": "physics.pop-ph",
    "132": "physics.soc-ph",
    "133": "physics.space-ph",
    "134": "q-bio",
    "135": "q-bio.BM",
    "136": "q-bio.BM, q-bio.MN, q-bio.NC, nlin.AO, nlin.CD",
    "137": "q-bio.CB",
    "138": "q-bio.GN",
    "139": "q-bio.MN",
    "140": "q-bio.NC",
    "141": "q-bio.OT",
    "142": "q-bio.PE",
    "143": "q-bio.QM",
    "144": "q-bio.SC",
    "145": "q-bio.TO",
    "146": "q-fin.CP",
    "147": "q-fin.EC",
    "148": "q-fin.GN",
    "149": "q-fin.PM",
    "150": "q-fin.PR",
    "151": "q-fin.RM",
    "152": "q-fin.ST",
    "153": "q-fin.TR",
    "154": "quant-ph",
    "155": "stat.AP",
    "156": "stat.CO",
    "157": "stat.ME",
    "158": "stat.ML",
    "159": "stat.OT",
    "160": "stat.TH"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "A.m": 0,
    "Artificial intelligence and nonmonotonic reasoning and belief\n  revision": 1,
    "Comptuational science": 2,
    "Computer Science": 3,
    "H.m": 4,
    "IEEE": 5,
    "MIMO, relay, queue-aware, distributive resource control": 6,
    "Mathematical logic and foundations": 7,
    "aaai.org": 8,
    "adap-org": 9,
    "artificial intelligence, approximate reasoning": 10,
    "astro-ph": 11,
    "astro-ph.CO": 12,
    "astro-ph.EP": 13,
    "astro-ph.GA": 14,
    "astro-ph.HE": 15,
    "astro-ph.IM": 16,
    "astro-ph.SR": 17,
    "cmp-lg": 18,
    "cond-mat": 19,
    "cond-mat.dis-nn": 20,
    "cond-mat.mes-hall": 21,
    "cond-mat.mtrl-sci": 22,
    "cond-mat.other": 23,
    "cond-mat.quant-gas": 24,
    "cond-mat.soft": 25,
    "cond-mat.stat-mech": 26,
    "cond-mat.str-el": 27,
    "cond-mat.supr-con": 28,
    "cs.AI": 29,
    "cs.AR": 30,
    "cs.CC": 31,
    "cs.CE": 32,
    "cs.CG": 33,
    "cs.CL": 34,
    "cs.CL, cs.AI, math.CT": 35,
    "cs.CR": 36,
    "cs.CV": 37,
    "cs.CY": 38,
    "cs.DB": 39,
    "cs.DC": 40,
    "cs.DL": 41,
    "cs.DM": 42,
    "cs.DS": 43,
    "cs.ET": 44,
    "cs.FL": 45,
    "cs.GL": 46,
    "cs.GR": 47,
    "cs.GT": 48,
    "cs.HC": 49,
    "cs.IR": 50,
    "cs.IT": 51,
    "cs.LG": 52,
    "cs.LO": 53,
    "cs.MA": 54,
    "cs.MM": 55,
    "cs.MS": 56,
    "cs.NA": 57,
    "cs.NE": 58,
    "cs.NI": 59,
    "cs.OH": 60,
    "cs.OS": 61,
    "cs.PF": 62,
    "cs.PL": 63,
    "cs.RO": 64,
    "cs.SC": 65,
    "cs.SD": 66,
    "cs.SE": 67,
    "cs.SI": 68,
    "cs.SY": 69,
    "econ.EM": 70,
    "eess.AS": 71,
    "eess.IV": 72,
    "eess.SP": 73,
    "gr-qc": 74,
    "hep-ex": 75,
    "hep-lat": 76,
    "hep-ph": 77,
    "hep-th": 78,
    "math-ph": 79,
    "math.AC": 80,
    "math.AG": 81,
    "math.AP": 82,
    "math.AT": 83,
    "math.CA": 84,
    "math.CO": 85,
    "math.CT": 86,
    "math.CV": 87,
    "math.DG": 88,
    "math.DS": 89,
    "math.FA": 90,
    "math.GM": 91,
    "math.GN": 92,
    "math.GR": 93,
    "math.GT": 94,
    "math.HO": 95,
    "math.IT": 96,
    "math.LO": 97,
    "math.MG": 98,
    "math.MP": 99,
    "math.NA": 100,
    "math.NT": 101,
    "math.OA": 102,
    "math.OC": 103,
    "math.PR": 104,
    "math.QA": 105,
    "math.RA": 106,
    "math.RT": 107,
    "math.SP": 108,
    "math.ST": 109,
    "nlin.AO": 110,
    "nlin.AO, nlin.CD, q-bio.NC, physics.bio-ph, cond-mat.dis-nn": 111,
    "nlin.CD": 112,
    "nlin.CG": 113,
    "nlin.PS": 114,
    "nucl-ex": 115,
    "nucl-th": 116,
    "physics.ao-ph": 117,
    "physics.app-ph": 118,
    "physics.bio-ph": 119,
    "physics.chem-ph": 120,
    "physics.class-ph": 121,
    "physics.comp-ph": 122,
    "physics.data-an": 123,
    "physics.flu-dyn": 124,
    "physics.gen-ph": 125,
    "physics.geo-ph": 126,
    "physics.hist-ph": 127,
    "physics.ins-det": 128,
    "physics.med-ph": 129,
    "physics.optics": 130,
    "physics.pop-ph": 131,
    "physics.soc-ph": 132,
    "physics.space-ph": 133,
    "q-bio": 134,
    "q-bio.BM": 135,
    "q-bio.BM, q-bio.MN, q-bio.NC, nlin.AO, nlin.CD": 136,
    "q-bio.CB": 137,
    "q-bio.GN": 138,
    "q-bio.MN": 139,
    "q-bio.NC": 140,
    "q-bio.OT": 141,
    "q-bio.PE": 142,
    "q-bio.QM": 143,
    "q-bio.SC": 144,
    "q-bio.TO": 145,
    "q-fin.CP": 146,
    "q-fin.EC": 147,
    "q-fin.GN": 148,
    "q-fin.PM": 149,
    "q-fin.PR": 150,
    "q-fin.RM": 151,
    "q-fin.ST": 152,
    "q-fin.TR": 153,
    "quant-ph": 154,
    "stat.AP": 155,
    "stat.CO": 156,
    "stat.ME": 157,
    "stat.ML": 158,
    "stat.OT": 159,
    "stat.TH": 160
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
